{"Week 15 - November 28th Week Blog": {"date": "20161203", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThe last week of school has always been, traditionally, a mess. Its really that time of year where the professors desparately attempt to finish up the school year. I didn't necessarily make it sound terrible, but its much worse than it sounds. Contrary to this tradition, Professor Downing was very kind to keep this week to project presentations and the final SWE test. Most of the material for the SWE test was managable, and the presentations were (as expected) the best part of the class, where the teams show off their final product. Essentially, this week consisted of mostly studying for the test and preparing for our project presentation.\n\n\n~~ What is in your way? ~~\n\nOther than the need to sleep and other class obligations, I suppose a lack of confidence, energy, and time. I wasn't sure if I would have enough time to study for the SWE test and prepare for the SWE final project presentation. Fortunately, I put a lot of effort during the Thanksgiving break to keep myself from falling behind in SWE.\n\n\n~~ What will you do next week? ~~\n\nNext week? I don't think there is anything left next week other than this blog. I finished all of the other extra credit and I gave everything I could to finish strong in this class. I suppose this next week will be me anticipating my final grade in this class.\n\n\n~~ My experiences with CS373 this week: ~~\n\nThis week was not as terribly rushed as I was expecting it to be. The experiences this week mostly consisted of be awed by other group projects and immense stress over finalizing the finishing touches of my team's project. Overall, this week has been fascinating and worthwhile. I learned a great deal about the other team's approaches and the different critiques that certainly would have been game changers for our project.\n\n\n~~ My reactions to CS373 material this week: ~~\n\nInstead of being surprised by Downing, I was surprised by the beauty and strategy of the other students final products. They did such an elegant job of maintaining efficient backend and frontend communication, while maintaining great UX. Most of the other material in this class was primarily a review for the test this week, so I experienced no surprises there. The material this week has been comfortable and reaffirming.\n\n\n~~ Tip of the Week: ~~\n\nIf you are ever designing an encryption or signing scheme, always use conventional and published schemes. You'll most likely make your entire system more vulnerable if you make shift an encryption/signing scheme from different published schemes. One example of this is the iMessage. It turns out that any attacker can forge a signature or decrypt a iMessage in 2^28 queries (which would probably take you 3 days, but the real issue is that it can be done in polynomial time). This vulnerability is due to iMessage trying to make shift their own encryption scheme combining multiple techniques, which ended up backfiring.\n\n\n~ Overall CS373 Experience: ~\n\nMy experience with CS373 SWE was fun and interesting. The time commitment was not nearly as terrible as some of the other courses I've taken, but the amount of material covered met the criteria of many of these other courses. The tests tested my knowledge very well, the projects practiced and tested my pair programming/communication skills, the readings presented an amass of new material, and the lectures revealed a variety of behaviors and techniques.\n\nI spent the first half of this semester working in individual and small group projects. These projects were small code bases, but consisted of a great amount of thought and effort. Optimizations and code clarity were the key to ensuring successful project development practices.\n\nThe second semester was mostly spent on contributing to a team based project. My team mates and I spent a great deal of time establishing camaraderie and efficient backend and front end services. While our professionalism and experiences didn't amount enough to making our project easy, the way my team handled the challenges helped give me assurance that my team mates were well equipped for the challenges we faced.\n\nThe course was fun, informative, interesting, stressful, relaxing, dramatic, and kept my attention the entire way through. Professor Downing did a great job teaching this course.\n", "title": "Week 15 - November 28th Week Blog", "category": "cs373"}, "Week 15 - May 8th Week Blog": {"date": "20160508", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nAs always, hell week is a nightmare. It wasn't so bad for OOP, but the collective amount of stress and responsibility from my other classes made this week rather busy. For oop, I spent the majority of the time studying for Test 2 and attending the lectures. While it doesn't seem like I did a lot, the quantity of content for Test 2 is very large. Test 2 included material from projects 3 through 5 and every lecture since Spring Break (about 6 weeks worth of material). The lectures this week were interesting, finishing up the details of how to make vector adaptable to user defined allocators and how to make a good handler class.\n\n2. What is in your way?\n\nThe other courses I'm taking are really taking a lot of my energy and time. Its interesting how much work each course can throw at you at the last second. What is even more fascinating is how desparate some of the professors are in ensuring that all of the material is covered. Its all right though, the last bit of material from all of my classes seemed to be very important and useful. If only I had more time and energy to focus on OOP instead of these other classes...\n\n3. What will you do next week?\n\nWe don't have anymore lectures or classes after last Friday, and because of this, we don't have anymore OOP material to go over. In addition to this, our last test (we don't have a final) was last Friday, so it looks like we're done in terms of the OOP course. This doesn't mean I won't be trying to program anything in a OOP mindset anytime soon. Perhaps this next week I'll experiment a bit with developing some sort of game. We'll see, but I do plan on imporoving my public github profile. It looks a little bit barren even with how much I use git.\n\nMy experiences with CS371P this week:\n\nThis week was dreadful, but useful. The lectures were especially useful in explaining the importance and the purpose between handle1, handle2, and handle3 classes. I feel like making vector adaptable to allow user defined allocators could have been a bit self explanatory, but it was still useful to hear why and how it works from Downing. My experiences with Test 2 was like the Titanic. I felt confident about the material I knew and had spent at least a dozen hours studying for the test, but the test was like a unforeseen iceberg. It probably would be a better description if it was some random rogue wave hitting my cruise. Any way, I felt that all the material from OOP was nearly useless on that test. Test 2 definitely didn't feel like it tested anymore than 10% of my knowledge of OOP. The test appeared to be a tad long, especially since we had 5 coding questions for 50 minutes we were testing for. Not a single multiple choice question... not even a short answer. It was a disappointing test.\n\nMy reactions to CS371P material this week:\n\nThe material was fascinating. The optimizations for the handlers that Downing described could cut out so many computational steps that were unnecessary. In fact, his implementation looked just like a fancy proxy that helped cut out space and time use. The optimizations for the vector was interesting too, but adding the flexibility with the allocator didn't seem too important. Maybe I'll need it sometime in the future.\n\nTip of the Week:\n\n", "title": "Week 15 - May 8th Week Blog", "category": "cs371p"}, "Week 11 - April 10th Week Blog": {"date": "20160410", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week we dove fairly deep into how the vector datastructure is implemented. Downing's lectures gave a great deal of detail to the functionality and purposes of how vector was developed. Even certain optimizations were suggested, that helped prevent redundant and vulnerable code. My freetime was mostly spent working on the Darwin project. Even though the project seemed adequately easy, the actual solution to the project was a total nightmare. Many of the other students probably found the project easy, but it was certainly a challenge for me. Even though the project was strenuous in all sorts of ways, the project showed its colors in positive ways. Darwin took to be one of the more fun projects, where I learned more about abstraction and the basis of game development than I have ever before. I would definitely do again.\n\n2. What is in your way?\n\nExcept for a Algorithms test and a Network Security and Privacy project being due, there wasn't a lot in my way. The test and project didn't take a great deal of my time, and so what remained to be the biggest obstacle of all turned out to be finding a project implementation of Darwin that my partner and I would agree on. While my partner and I conflicted in our own preferred implementations, the rewriting of the code base took dozens of more hours of my time than it should have.\n\n3. What will you do next week?\n\nThis next week will likely be very relaxing. It turns out that I don't have a single assignment, project, or test due the next week. So attending class and doing the readings is the only possible thing OOP related that will be keeping me busy. Other than school, I'm leading a 6 hour concert event at Greg that involves around 4 music organizations, so that'll absorb a ton of my time too. Hopefully getting started in Project 5 Life will be a core topic of interest for me next week, since I hear its even worse than Darwin... Which can be scary but sounds like it'll be another trial that'll thoroughly enjoy.\n\nMy experiences with CS371P this week:\n\nThis week was a little feverish with stressing on the Darwin project. As exciting as learning about vectors are, my thoughts on Darwin took out alittle bit of the joy I could've experienced this week. It was mostly good experiences though, where I felt I was extremely productive. The thing about Darwin wasn't even the bugs, for they only took moments to fix, but the size of the code base that had to be written. So what was my experience this week? It was like a downhill rollercoaster, where every turn looked like it could be alittle more frightening, but truly was the time of my life.\n\nMy reactions to CS371P material this week:\n\nI really enjoyed the material this week! Even though Vector is a complex datastructre structure to learn about, Downing does a great job in ensuring the students understanding the inner and outer structure of Vector. I was very surprised to see the strategies Vector uses to reduce redundancy and increase the security of Vector, but my reactions mostly pertained to feeling more confident in using Vector in a practical and professional way.\n\nTip of the Week:\n\nWhen you are pair programming, its very important to ensure that you and your partner agree on a software design from the start. If y'all decide it mid way through the implementation, it will be even harder to agree on a working solution than before. I understand that a lot of the code may not be something you can predictably work on both being satisfied on, but its important that you try to cover all the bases as soon as you get the project description. It may very well save you dozens of hours of refactoring code.\n", "title": "Week 11 - April 10th Week Blog", "category": "cs371p"}, "Week 6 - September 26th Week Blog": {"date": "20161002", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nIn terms of SWE, the majority of my energy and time went towards the readings, preparing for the test, and attending class. We have the test that's coming up next Thursday, and really, I'm not very sure if I should be extremely intimidated or not. I'll probably be fine with how much time I've spent with the projects and SWE material so far though.\n\n\n\n~~ What is in your way? ~~\n\nAs always, I have a lot of organizational commitments as well as several projects due this week. Of course if I didn't need sleep, it would be easier to take care of all of the reading assignments and material at ease. I think this week was handled fairly well, so I wouldn't really consider any of my outside commitments to be jeopardizing my performance in SWE.\n\n\n\n~~ What will you do next week? ~~\n\nNext week will be very rough... but I'll surely be able to finish all the assignments and prepare for the test. Even though attending class lectures are important this week, preparing for the upcoming test will be the primary focus. Catching up on the reading assignments that I missed may be the third highest priority for this week, but I'm not entirely sure how much time I'll be able to put in to the readings this week.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nMy experiences this week are similar to my experiences from last week. The lectures are fulfilling and surprising with all of Python's hidden behaviors. Surely knowing the nature and underlying construction of Python, the lectures are critically important to my understanding of Python.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nMy reaction is happy and surprised, partly because of how many Python libraries are really written in C. I'm sure much of the material, especially with the odd exceptional behaviors, will be on the test.\n\n\n\n~~ Tip of the Week: ~~\n\nWhenever you want to have multiple activities on a single page (for Android), I would recommend looking up frames. There was an issue a few years ago to having a single screen share several activities, and fragments are google's answer to the issue. if you're in need of dynamic UI on Android, fragments are the way to go.\n\n\n", "title": "Week 6 - September 26th Week Blog", "category": "cs373"}, "Week 7 - October 3rd Week Blog": {"date": "20161009", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week was filled with test reviews and class lectures. Since the reading material wasn't going to be on the test, it seemed acceptable to me that I spend more of my time reviewing the semantics and behaviors of Python from previous lectures, projects, and notes. The reading material deemed to still be important for my understanding of the concept of designing software efficiently and understanding the languages more suitably.\n\n\n\n~~ What is in your way? ~~\n\nI was swamped with an Android App project and with Rachel coming in town, my time quickly disappeared. Its amazing how much time a small app or even a person's visit can consume. The android app eventually became a small obstacle that wasn't hindering my success in reviewing the needed material for the test, but Rachel's visit surely took up the saved time that wasn't spent on the App.\n\n\n\n~~ What will you do next week? ~~\n\nNext week will primarily be beginning the new project, organizing the new team, attending lecture, and continuing to finish the readings. While the project doesn't seem entirely too challenging, I know it will be time consuming (especially the writing flag portion). Kick starting the project itself will perhaps be the most difficult part, and hopefully my team will work well in ensuring the kick start happens quickly.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nThis week was rather tense and stressful, but definitely worth the experience. I learned a lot about packing, unpacking, and Range Iterator. I know developing iterators are critically important to software engineering (really very basic too), but the packing and unpacking was the most useful material for me to find out. I've always been curious as to how many of the languages took care of variadic functions, and this really makes sense to me.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nMy reaction to the material this week is, as always, inspired and motivated to learn more in depth the underlying reasons and behaviors of the new material presented. This week we spoke on more on iterators, packing and unpacking parameter variables, and I was seriously surprised on how packing and unpacking works.\n\n\n\n~~ Tip of the Week: ~~\n\nWhen ever you want to use a function that is memory or time intensive, its important to always invoke this function on a separate thread from the main. While it may be helpful to use a new thread for the time/memory intensive function, its also very dangerous (with race conditions). One way to avoid race conditions all together is to use prewritten data structures that have synchronization already built in, or to use specifically asynchronous threading. Asynchronous threading provides the programmer the ability to not have to worry about race conditions but have the full benefits (minus a few) of multithreading.\n\n\n", "title": "Week 7 - October 3rd Week Blog", "category": "cs373"}, "Week 1 - January 24th Week Blog": {"date": "20150129", "content": "\nOn the topic of CS371P:\n\nTLDR\n\n1. What did you do this past week?\n\nI attempted to read all of the class material on time, but alas, I feel unconfident about the amount information I'm retaining from the text.\n\n2. What is in your way?\n\nThe other classes I'm taking are not project intensive, but reading intensive. These other reading assignments are blocking the interest I have in diving deep into the topics of Object Oriented programming.\n\n3. What will you do next week?\n\nI will spread out the reading assignments of the classes so they don't collide with each other.\n\n\nReading assignments have never really had a place in my heart, but the literature that I've been going through for the classes this semester have been absolutely exciting. From security, to complex algorithms, and to Object Oriented Programming, the content seems to be exciting and with each passing minute, the material shows to be extraodinarily important to my career. Other than the reading assignments, I've only spent a few hours on starting the Object Oriented Project 1, but it hasn't made a huge amount of progress. The grand total of time spent on the Object Oriented Programming class is heavily dominated by the weight pressed on the reading assignments.\n\nWith so much value in the passages assigned, the knowledge seems to be alluring, but the total amount of substance is a bit overwhelming. I can feel my head growing more and more condensed, but I hope that it'll ease in the future. I've spent quite a few hours dedicated to understanding the content of An Introduction to Object Oriented Programming, and I'm still profusely struggling.\n\nThe only solution I can think of that can revive my fascination in the reading assignments is to spread out the reading tasks to different times of the day. With the room to breathe and think over the text that is read, the time given between each reading should help enhance my capabilty to comprehend the material better. I hope it'll also help with the efficiency between reading and retaining the matter of the topics read.\n\nIntegrating this new strategy may be tough for this upcoming week, because of all of the different events taking place (College of Natural Science Technical Career Fair and Organization meetings). One of my goals for this upcoming week is to manage the time and effort to try this action plan.\n\n", "title": "Week 1 - January 24th Week Blog", "category": "cs371p"}, "Week 7 - March 6th Week Blog": {"date": "20160306", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis last week's effort and time mostly pertained to winding down in the Object Oriented Programming material and trying to survive the overwhelming amount of work/tests from the other classes. In terms of the work actually done for this class, I ended up just doing the readings, getting started on the projects, and attending the lectures. PLanning for the project that is due after Spring Break was a huge priority this week, as there will be no time for me to really work on the Allocator project until I get back from my Spring Break vacation.\n\n2. What is in your way?\n\nThis past week was swamped with several tests, assignments, and a project that each required at least 10 to 35 hours of work. The ridiculous amount of time demanded for this following week became a huge obstacle in me being completely and wholesomely dedicated to doing well in planning the project for the upcoming project due date.\n\n3. What will you do next week?\n\nNext week I'll be out of town on my spring break. It'll be very tough to keep up with finishing the project before its due date, but definitely not possible. It looks like there is nothing that is needed to be read or done but the project assignment, so that'll be my main focus for object oriented programming this week.\n\n\nMy experiences with CS371P this week:\n\nThis week's experiences were mostly good experiences where I was excited to learn about the upcoming project and the content the speaker gave a talk on. Project Allocator looks like it'll be a fun memory allocation project that'll require a lot of thought but definitely a good amount of growth. The class time and project preparation has me excited but my experiences hasnt been a lot of growth, just good preparation for growth to happen.\n\n\nMy reactions to CS371P material this week:\n\nMy reactions this week were mostly with excitement, but that could probably be because of the upcoming Spring Break that was happening this next week. The Allocator project details kept my attention, so it was interesting and reminded me a lot of CS439 Operating Systems. The lecture given by the guest also caught my attention, where I felt he gave a lot of great advise and good points in the professional world of programming.\n\n\nTip of the Week:\n\nBe careful about super cookies in your devices. It turns out that the manufacturers can put in super cookies in your devices that they create which cannot be removed. Because of this, they can track everything and anything you do. There has been a push to force manufacturers to remove them, but they are yet to be removed. So whatever you browse or do, make sure its done carefully or on devices that contain no super cookies.\n\n\n\n", "title": "Week 7 - March 6th Week Blog", "category": "cs371p"}, "Week 9 - March 28th Week Blog": {"date": "20160328", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nSpring Break brings peace and comfort, but the return of stress and anxiety will always come back in the light. The hour upon arriving back into Austin, I had to spend the majority of the day and night working with my partner on the OOP project (which was due that following Thursday). Luckily, my partner and I managed to have a good grasp of the concepts and expectations of the project, so implementing the solution was nearly a breeze. The days afterward mostly composed of reading about the evils of extends as well as listening to lectures about the different uses of constants and array types with in the object oriented structure of c++.\n\n\n2. What is in your way?\n\nWhile this class provides many challenges of its own, the remainder of my courses do pose a heavy workload that doesn't amount to nearly as much of a good ratio of reward to work spent as this course does. Alongside the other courses, the follow up of Easter, Spring Break, Rez Week, and a Christian retreat creates a deterrence from focusing solely on Object Oriented material.\n\n3. What will you do next week?\n\nNext week, I'll be starting the next project with my partner. The project will be composed of writing classes for a game/competition platform. I think it'll be interesting to construct, especially since my next partner specializes in game development. The next week will also be very fun to learn about vectors, their attributes and functionality. As vectors as one of my favorite datatype, its exciting to get the opportunity to learn the inner and outer details of Vectors.\n\nMy experiences with CS371P this week:\n\nMy experience this week with CS371P felt a bit rushed. With the project due, the readjustment into school, and with Easter this weekend, it was difficult finding the time to complete my projects, attend lecture, and do the readings while also managing to get any sleep. As is all of the lectures, I found the material being taught very applicable. I've never had the opportunity to be taught about the uses and reasoning behind the system of constants and arrays in c languages. Every lecture seems to help me grow in my understanding around typical object oriented topics that I have a hard time wrapping my head around.\n\nMy reactions to CS371P material this week:\n\nThe material in CS371P this week is, as always, very exciting. It has been confusing and frustrating for me to have to research about constants and treatment towards arrays for the longest time, but the material this week cleared my bewilderment in those subjects. I also feel more professional knowing about some of the cons and pros of using extends.\n\nTip of the Week:\n\nBe very careful not to ever do a free over a region of memory that has already been freed and coallesced to a larger malloc'd block, otherwise your program may be vulnerable to attacks. If a attacker knew the that your program had a region that was freeing over a already freed region, they could take advantage of your program by manipulating the header of the freed block with the input they put in. I won't go into detail of how, because I don't want to encourage anyone to undertake a goal in abusing the process, but be sure to always set the pointer to null if you free a already freed block that is then coallesced to a larger allocated block.\n\n", "title": "Week 9 - March 28th Week Blog", "category": "cs371p"}, "Week 4 - September 12th Week Blog": {"date": "20160918", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nTired and sick, I probably spent the majority of this week in bed, but I did my best to be productive in this class. This past week was busy with attending class, finishing the reading assignments, and starting the Netflix project. While the overall project seems a bit overwhelming, the algorithms and requirements that we need to accomplish aren't very intimidating. After several meetups with my partner, we have an intuitive and confident outline as well as much of the code already written. I hope this upcoming week proves to show that the effort we put in the project was more than enough.\n\n\n\n~~ What is in your way? ~~\n\nInstead of organizations cluttering my calendar, my path was mostly deterred from allergies and sore throats. I could hardly stay awake for many of the lectures I sat through (Downing's and the others). Being out of town this weekend also contributes to the notion that this last week was certainly less productive than I hoped for. Other than that, I decided to keep a tally of how many hours I did spend with my organizations. It turns out that I spent about 12 hours with the Wesley and Navigators from Monday through Thursday. If I spent that time working on my projects, I might be able to get them done quicker, however, I'd probably have a spiritual or emotional breakdown. I guess for the sake of spiritual and emotional sanity, I will continue to spend as much time as possible at these organizations.\n\n\n\n~~ What will you do next week? ~~\n\nI hope that I will get better next week, but this next week will definitely be a race to finishing the Netflix project. I've made physical sacrifices to make deadlines before, and I suppose I'd be willing again. The only reason I'd be willing to, though, is because I wouldn't want to hold my partner back. If all else fails and I'm fairly sick, I'll definitely make sure to speak to Downing and my partner about my situation, but I'm sure everything will work out.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nIt probably would've been better if I was feeling better, but the lectures were certainly interesting. This week we learned about the netflix project, a competition that took place 6 or so years ago, and that took 3 years to find a winner. Some of the algorithms for solving netflix seem self explanatory, but understanding the use of a cache, the objective, and the RMSE generation will definitely help my partner and I complete this project. We also had someone from Bloomberg speak, which was helpful in knowing the applications of our academics towards our careers.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nThe course material was certainly fun and exciting this week. I would've been more into learning the material this week, but the sickness really took a toll out of my attitude towards taking the material more seriously. I definitely felt that all of the material from this week will and should have a significant impact on the way I design my projects, look for jobs, and engage my work.\n\n\n\n~~ Tip of the Week: ~~\n\nFor those of you who want to learn android development, Android Studio is the key to easily implementing android apps. While the official Android Studio release (after Beta) took place only a few years ago, its important to note the tools and libraries that Android Studio provides. More so than any other tool provided, Android Studio provides the UI friendliness that a programmer would need to visual the affects of his/her code.\n\n\n", "title": "Week 4 - September 12th Week Blog", "category": "cs373"}, "Week 5 - February 21st Week Blog": {"date": "20160221", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis previous week's focus has been primarily centralized around the consistency and preparation of the upcoming test next week. With all of the book material, the c++ class notes, the projects, and readings, the amount of content that needs to be absorbed seems to be overwhelming for only one week of studying to handle. Catching up on Object Oriented Programming material was the key goal and ambition as a attempt to do well on next week's test.\n\n2. What is in your way?\n\nThere aren't a lot of obstacles in my way. The previous week was horrendeous, so naturally this week became a catch up on sleep as well as homework. Waking up early in the morning to get the studying and readings done has been fairly challenging lately, where I've felt chained to my bed. I need to stop being so passive and push myself to attain the studying they I want to accomplish before the test.\n\n3. What will you do next week?\n\nNext week will luckily be not so terrible. The only thing I have this upcoming week is this test and a few project meetings. So this next week will mostly consist of test reviewing and studying. I will do my best to dedicate time to accomplish the material review.\n\n\nMy experiences with CS371P this week:\n\nEvery week is always a surprise and fun experience. Last week we learned quite a bit about assigning functions to variables using auto and other exchangable formats. Also this week we had a speaker visit the classroom and talk about the world of open source development, its benefits on your professionalism, and the wonders of how the open source work can help elevate the productivity of your own work and the work of the company you're working for. The experiences were certainly fun and engaging, where the examples and lectures gave in depth explanations about variables saving functions/methods. The speaker was an exiting experience too, which helped me feel that I needed to start dedicating myself to the open source world.\n\nMy reactions to CS371P material this week:\n\nI felt a mix of surprise and content, as the lectures and the speaker gave great advice and in depth knowledge of not only objet oriented programming but professional contributions to the software industry. I felt more engaged and equipped to begin moving towards accomplishing the software design goals that I've set aside for myself.\n\nTip of the Week:\n\nWhen you are pair programming with one or two other individuals, always be sure to bring food or drinks to ensure productivity. The contribution of this fuel helps a long ways in keeping the mind and body in tact with the goals and obligations of that time. Without the fuel you need, you'll lose the energy, patience, and creativity that you so desperately need to get that project done (or bug fixed).\n\n\n", "title": "Week 5 - February 21st Week Blog", "category": "cs371p"}, "Week 13 - November 14th Week Blog": {"date": "20161120", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nOur final SWE project was due last Thursday. While the project was less demanding than the previous ones, my group still had several issues and bugs to resolve. Much of last week was spent polishing and finishing the final requirements of the project (especially since we were expected to present it). The free time I had, aside the time spent on the project, was used to stay on top of the readings and attend lectures. Much to my surprise, I didn't have as much free time for the readings and lectures due to a sinus infection. Hopefully next week's break will help regenerate my health.\n\n\n~~ What is in your way? ~~\n\nLast week was hard pressed for time (since most of my classes were rushing to finish assignments before Thanksgiving). Also, I was sick for the later helf of the week, really just a sinus infection, but the illness put me out of work for several days. I needed those days to improve the project and finish other assignments, but I realized I needed rest more than anything.\n\n\n~~ What will you do next week? ~~\n\nNext week will be a extremely short week. In terms of this class, perhaps just attend Monday lecture, do any of the remaining readings, study a little bit for the test, and finish the final requirements of the project (the presentation, critiques, and visualization). I think for the most part, next week will be spent ensuring that the visualization works.\n\n\n~~ My experiences with CS373 this week: ~~\n\nMy experiences were not entirely exciting. Downing spoke on several important topics that are critical to software engineering (dynamic binding, interfaces, singleton design), but again, its been mostly review for me. A lot of modern full stack programming utilizes these techniques, so experiencing Downing's lectures and the real world demand for this kind of programming just helps solidify my understanding of these topics.\n\n\n~~ My reactions to CS373 material this week: ~~\n\nI wasn't exactly ecstatic to learn or review the material Downing went over in lecture, but it has been very helpful to be reminded of these topics. I was slightly happy to finally hear Downing speak on these topics, but I think he spoke on them really too late in the game. He should've gone more in depth on the singleton design and dynamic binding before our second project phase.\n\n\n~~ Tip of the Week: ~~\n\nIf you are ever having trouble testing a Android app on a emulated device, perhaps you'll want to try GenyMotion. GenyMotion provides the most realistic Android emulators (using virtual box) to help the programmers with testing their apps on the variety of architectures, without heavy expenses. Of course, if you are trying to develop for augmented reality (which involves gps and the camera), GenyMotion can only provide you some, but not all of the functionality you're looking for. You have to manually change the directions, bearings, and gps if you want to test gps tracking. Also, the camera doesn't always work (most of the time it does though). Lastly, the best part is that you can try it (for however long you want) for free!\n", "title": "Week 13 - November 14th Week Blog", "category": "cs373"}, "Week 2 - January 31st Week Blog": {"date": "20150206", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\n2. What is in your way?\n\n3. What will you do next week?\n\n\nMy experiences with CS371P this week:\n\nThe week of January 31st appeared to be a rather busy week with the projects and new material. While the lectures alone provided key information about exceptions and incrementation in C++, which caused me to be a bit in awe on the topics, the biggest priority was to complete the first project on time. With a combination of career fairs, recruiting events, and other class projets, finding the time to dedicate to this project was quarrelsome, much of which led to a few nights with little to no sleep. Through several dozen hours of learning the systems, much of included Travis CI, github, Google Tests, etc., I felt confident in the progress of the project.\n\nThe challenge definitely didn't seem to be programming the Collatz problem in c++, since all that the assignment required was a simple solution with a cache. Even the cache didn't seem to be entirely challenging, as it was supposed to be a build of your simplest cache into a improved state. Making sure the systems being used on the Collatz assignment were operating properly was more of a challenge, since the software can be buggy and in the way sometimes.\n\nThe biggest time consumer, however, was trying to get the Sphere tests to pass. Although Sphere indicated the project had the right answers, the timing continued to be exceeded by a small amount. Creating a meta cache probably would have accomplished this goal, however, the due date deadline for the project was all too near to upgrade the cache.\n\nI would've managed to get the proper cache working if I had dedicated more time to the project earlier on, but I couldn't blame myself for that. With all of the organizations starting up the week before, I could hardly do my homework, much less breathe. Certainly a intimidating obstacle, my time dedication to organizations and personal ambitions are masking my ability to pursue my courses in a better angle. This week I sacrificed the dedication to going to many of the organization meetings and even suspended my personal projects to ensure that all of the class assignments were completed on time.\n\nNext week, I plan on taking advantage of the weekend to reduce the amount of weekday school work, so I can reconsider going to my organization meetings again. Hopefully, I can also readjust my schedule to fit in some personal project work too. As for what I'll be doing this week for CS371P, I'll be starting the project early, finding a partner to work with, and continue to get as much of the readings accomplished as possible.\n\nMy reactions to CS371P material this week:\n\nThe material this week impressed me in many degrees. While I was a little knowledgable about exceptions and the different methods of incrementing, I was a little shocked to find out the usefulness of using the try catch phrases versus the asserts/unit tests. The try catch phrases are obviously one of the most useful built in functions in C++, and I can see how they refrain the programmers having so many headaches at work. The differences in the incremention and left side/right side arithmetic was interesting too, but only in that it was interesting to see how the built in arithmetic operations work.\n\n\nTip of the Week:\n\nI recently ran into a random blog that I never thought I would read. The blog is managed and owned by a distinguished researcher who is now a author, named Michael Nielsen. He is a author of a profoundly important book on super conductors and their role in super computers, but his research into neural networks is something of which I've taken much interest in. He is currently in the works of writing on his research on Neural Networks/Deep Learning, and his material is absolutely astounding effective. You can see his blog on it here: neuralnetworksanddeeplearning.com/chap1.html\n\nI suggest that you read through his material, because it goes into great depth on the topics of deep learning and really, he explains it very well. Michael Nielsen even maintains a Github repository that contains a working Python 3 program demonstrating exactly what he writes on in his new book\n\nThis is all I have for to say this week, but if you have any questions or comments, feel free to comment or message me.\n\n", "title": "Week 2 - January 31st Week Blog", "category": "cs371p"}, "Week 10 - October 24th Week Blog": {"date": "20161030", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week seemed to be a lot calmer and easier than the previous weeks. Not only was one of the lectures cancelled, but another one was given by Pariveda Solutions. Essentially, this week only had one challenging lecture, which revolved around regular expressions. Studying regular expressions, finishing the reading assignments, and creating scrapers for the project are what took the majority of this last week though.\n\n\n\n~~ What is in your way? ~~\n\nThe data scraping for the project has been more difficult than I previous thought it would be. Due to the variety of APIs for the project, merging the data between the APIs has been a core issue. I suppose the difficulty of the task of collecting data is derailing my productivity in this class. Also organizations and leaving Austin for the weekend has hindered my ability to provide the effort and time to continue to focus on the course material. I feel that going home and attending the organizational events is helping me maintain a healthy manner of approaching these assignments.\n\n\n\n~~ What will you do next week? ~~\n\nNext week will compose mostly of finishing project 5, making the website dynamic. This will be mostly writing programs for data scraping and massaging the data so that the backend team can insert the data into the database. With the number of APIs and the variety of pillars of information we're providing, this may very well be a daunting task, but I'm sure we'll be able to accomplish it. I'll also be completing the readings and attending lecture.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nMy experiences with CS373 this week was pretty fantastic, but not as useful as the others. We only really had, in my opinion, one useful lecture. I hardly know anything about Regex, but Downing did a great job of explaining the basics to the class. I know that this material will be extremely useful in the future. As far as the presentation from Pariveda Solutions, I didn't feel extremely compelled to ask any questions, I just felt that the company repeated a lot of the key points that the other company presentations have given.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nI was extremely surprised and slightly confused while Downing went over the Regex material. Lots of the semantics seem to be common sense, but there are a lot of rules that don't really seem to be easy to understand. I enjoyed listening to the Pariveda Solutions presentation, but once again, I didn't feel all that impacted by what they offered as far as advice.\n\n\n\n~~ Tip of the Week: ~~\n\nWhen ever you are developing a program that needs to use a map, I would highly suggest using the Google Maps API. Google provides an array of APIs that are can save programmers hundreds of hours. For me, I had to sue the Google Map API for developing an Android app based game, and without the Google Map API, the augmented reality aspect of the game would be impossibly difficult to use. In order to use Google's APIs, you need to be sure to register for an API key and install the proper software that supports receiving or using the APIs. Luckily, Google API keys can be reused for other Google APIs, so the number of keys generated or used can be condensed (avoiding having to reregister for more keys).\n\n", "title": "Week 10 - October 24th Week Blog", "category": "cs373"}, "Week 10 - April 3rd Week Blog": {"date": "20160405", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week was very calm, where there was hardly any OOP material that was due. The majority of the OOP work was the project that is due the next week and the lectures about Vectors and Atlassian. My partner and I met up a few times to get the project planned out, but no essential progress to the actual code base itself. Sadly, it looks like this project will be a bit of a nightmare, for it has so much detail to it. The lectures weren't too involved, mostly a introduction to the Darwin project, the presentation by Atlassian, and a introduction to the infrastructure of Vector. It seemed like a somewhat unproductive week, but the papers were interesting. They made a lot of sense, especially from a security point of view, but they also opposed my understanding of the purpose of a lot of Object Oriented Programming.\n\n2. What is in your way?\n\nThe only thing that continues to be in the way is the other programming courses, where I have a major grade in all three of my programming classes due next week. The matter of the fact that each of these classes have been very costly to my time makes it hard to focus on each course individually. Also Rez week was a core candidate that absorbed a great deal of my time. Perhaps I am a bit too dedicated to my religious and out door pursuits, but its what keeps me happy. I think that having Rez week and my organization involvement is what keeps me calm and happy in the long run, so that probably effects my work ethics in this course ina  positive manner.\n\n3. What will you do next week?\n\nNext week will be a dramatic rush to get the project done. Despite there being a project and a test in my other classes due that same week, it might be hard for me to find time. Also my partner is showing a promising appeal to work on this early, so hopefully it won't be a terrible nightmare. Of course, I'll be reading and attending the lectures, I don't exactly have a reason not to attend or read anyway.\n\nMy experiences with CS371P this week:\n\nIt was a calming and encouraging week for me. Hearing about vectors, one of my favorite datastructures, getting a chance to relax and hear a company give advice on agile development, and finding out that the next project will be pretty much developing a game, my confidence in the productivity of this class was boosted. I had fun reading the articles that was against getters and setters too, where I am starting to realize the security holes in Object Oriented Programming.\n\nMy reactions to CS371P material this week:\n\nThis week brought out the excitement I have for Object Oriented Programming. Vectors and game development are both extremely attractive topics to me, and getting a chance to dive into both topics brings out a bit of the inner child in me.\n\nTip of the Week:\n\nIf you ever have trouble avoiding the use of getters and setters, consider using operator overloads, manipulating return values, and even using helper methods to improve the method communication and private variable manipulation of different classes. Through these different approaches, it can be a little tedious but you'll have a very powerful library of tools for your class that protect your program from exposing its security holes.\n\n", "title": "Week 10 - April 3rd Week Blog", "category": "cs371p"}, "Week 8 - October 10th Week Blog": {"date": "20161016", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week has been unusually calmer than most weeks, but its still busy with the SWE project #3. We only have to create a dozen or so static pages, but the scraping is perhaps the most time consuming parts of this. In order to have a realistic site, we have to find accurate and reliable data that fulfills the quota amount we're looking for. Well... it turns out that there are a lot of APIs available, however, registering for the keys and compiling/massaging all of the data we're querying for is becoming a heavy bottle neck.\n\n\n\n~~ What is in your way? ~~\n\nI wasn't terribly side swiped by outside obligations this week, but I still felt that there were many more wasteful distractions this week (such as getting more rest) as the prior weeks. Also, the projects and assignmnets in the other classes have certainly taken a toll on my committment towards this course.\n\n\n\n~~ What will you do next week? ~~\n\nThis next week will primarily be focused on finishing the SWE project #3, since its due on Thursday, October 17th. While the project doesn't seem like an impossible task, finalizing the data and polishing the product will probably cause more of an urgency than there should be. Attending class, reviewing the material, and finishing the reading assignments, of course, will also be key aspects of my busy work this upcoming.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nThis week has been a delightful experience. I'm very excited that we are now starting the projects that the course was mean't for. The material we covered (decorators) are definitely a lot more interesting and useful than I thought. I was always curious about what decorators are and the purpose of annotations in the code (such as beans in Java Spring framework).\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nMy reactions to the material this week is definitely enthusiastic and excited. The material we learned this week is newer than usual, and the projects we're taking on are certainly in a different category of \"team work\" based projects. As much as I love working on projects on my own, I especially love spending time on working on a team based project. The rest of the semester should be interesting for sure.\n\n\n\n~~ Tip of the Week: ~~\n\nMy tip of the week has to do with using beans on Java Spring framework based applications. Be sure to always take advantage of the bean annotations in the code, it saves so much time and makes the code so much more intuitive. Often times tracing what an API or a function does can be way too time consuming, so having a standard set of bean annotations or decorators can help ease the pain of code ambiguity.\n\n", "title": "Week 8 - October 10th Week Blog", "category": "cs373"}, "Week 3 - February 7th Week Blog": {"date": "20150207", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week was definitely more of a relief than the week before. With no projects, one assignment, and zero tests, the week cruised along just fine. I did experience a lot of difficulty trying to find a good time to meet with my partner, but it seemed to workout every other day. My partner and I did end up starting project 2, Voting, and we got more stuck on how to receive and store the input than how to implement the algorithm for processing the data given. In retrospect, it didn't take much time to understand how to parse and receive the input, it only took a little bit of research in the methods we were allowed to use. Also deciding on the object structure to use for each election was a core piece of our program.\n\n2. What is in your way?\n\nThere wasn't much in my way, but I did struggle with getting the readings done, as always. It seems like I keep getting farther and farther behind in the content I need to read over. This will end up being a nightmare if I don't fix this issue soon. Time isn't necessarily the issue too, since I do have a little each day, but the primary issue are my priorities. I've been getting more and more involved in my organizations, and dedicated less time to the development of my professional/academic career. Even though I gave up several personal projects to enhance my productivity on my homework, its still a sacrifice out of my professional development.\n\n3. What will you do next week?\n\nNext week will be a hellish of a time. I'll need to make sure to get my homework, projects, assignments, and readings done on time. Everything is sort of condensed on this one week, where everything is due this week and the remaining weeks are absolutely calm. The thing is that it isn't a lot of work, but I have a dedication to the Noblemen group in the Navigators to spend next week living with a dozen or two brothers in christ. It might be tough being sure to find the time to spend with my brothers as well as in get all the work I need done. I'm doing my best to get as much done as possible the weekend of February 12th. We'll see how things go.\n\n\nMy experiences with CS371P this week:\n\nIt was not that much of a surprising week, as there was a speaker for one of the days just going over his experiences at main street hub. He seems like a good guy and it was a cool presentation, but I honestly would rather spend more time on the material Downing goes over than what the speaker was focused on expressing to the class. The other material was somewhat shocking, one of which was the template <typedef variable>. I didnt realize that c++ provided this ability for the method/function parameters. Although it can be a dangerous object to use, it is so useful for handling various different types of parameters objects. Really, its brilliant.\n\nMy reactions to CS371P material this week:\n\nI was a bit bored with the lecture given by the speaker, even though it was semi useful. The other material seriously persuaded me to continue research the depth and abilities of c++ in object oriented programming.\n\nTip of the Week:\n\nWhen you're using the internet on your router, make sure to change the password for the router admin settings page. Believe it or not, a website could run a simple script on your computer exposing the ip address of your router and login to the router settings. They could even manipulate the dns table of the router without you knowing, which can be very dangerous. My tip is to becareful when searching for code errors. Some of these sites may know this and take advantage of your vulnerability. They won't be able to do anything to your router or computer dns tables if you just change the default admin password of your router. Just do it. JUST DO IT.\n", "title": "Week 3 - February 7th Week Blog", "category": "cs371p"}, "Week 9 - October 17th Week Blog": {"date": "20161023", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week was entirely composed of working on the project. A brutal and almost hopeless task, my team and I managed to persevere through all of the objectives. While phase didn't appear intimidating at first, the requirements certainly piled on as the due date grew closer. I also spent a lot of time attending class and finishing the readings, but the primary objective pertained mostly towards completing the project.\n\n\n\n~~ What is in your way? ~~\n\nThe other courses are definitely beginning to pile on. The additional work is starting to seriously get in the way of making core contributions to finishing the projects effectively. Also, a lot of personal obligations continue to be an obstacle. I was hoping to perform better on the crypto test and the projects, but I suppose I can only do so much in one week.\n\n\n\n~~ What will you do next week? ~~\n\nI'll be playing catchup next week. I'm so behind in the projects, its actually starting to scare me. I guess it wouldn't be a problem if there wasn't so many small issues. I suppose I'll need to focus myself on ensuring that we finish the core parts of the website before worrying about all of the small details. Also, I'll definitely be attending class and completing the assigned readings.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nThis week was a little disappointing... Not to say that the material in the lectures weren't interesting, just my performance towards this and other classes was not up to par to what I was hoping for. The material over callables, select, project, and joins were very interesting and seemed extremely relative to the projects at hand, and that was worth while. The issue mostly leaned toward the confusion my team faced while finishing the project.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nMy reaction to the material this week was partially confused, but definitely felt that the material will be and is already rewarding. I have experience in SQL programming, but the material given in the lectures was a new flavor of database management that helped give me more excitement.\n\n\n\n~~ Tip of the Week: ~~\n\nWhen you are building a website, always be sure to know all of the tools of trade. The majority of the work will be learning and adopting the tools, not so much the development. Developing before understanding the tools will lead to far more wasted time and confusion than just spending the time to fully grasp the nature of those tools. Also, there are a lot of useful tools on Slack that can be helpful to ensuring efficient communication in between your team members.\n\n", "title": "Week 9 - October 17th Week Blog", "category": "cs373"}, "Week 11 - November 1st Week Blog": {"date": "20161106", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week has been completely packed with projects, assignments, tests, and lectures. As tough as this week has been, it did feel very managable (which I didn't really expect). I spent the majority of this week's free time on the project, gathering and massaging the data for the project as well as assisting other members in their tasks. I felt fairly accomplished after completing my project objectives, but that was at a cost of less time spent on the readings and focusing in lecture.\n\n\n~~ What is in your way? ~~\n\nIt seems like a recurring theme this semester is my outside obligations and the fact that all of my classes like to make their due dates at the same time. Its been nice having a week off, but thats always leading to a hell week. If I spent less time leaving town and in organization meetings, and more time spent on assisting my teammates and finishing the readings, I think I would be doing better in this class.\n\n\n\n~~ What will you do next week? ~~\n\nNext week wil mostly comprise of working on the final project (only a couple of weeks left), finishing the final reading assignments, and attending lecture. There isn't a lot of diversity between each week, but this class sure does keep me busy. Perhaps this week will be primarily focused on producing the search engine apis for the search page of our project.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nThis week included many stressful moments, many of which composed of a semi miniature break down. I was happy with my accomplishments this week, especially with the data collection and massaging. I enjoyed the lectures, especially in the manner that we're approaching data management with Python and SQL. I've down independent studies in SQL, relational, and non-relational data storages/databases, but its been a while since I've gone over this kind of material. Its nice to learn about these topics through Downing's style of teaching.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nI was slightly baffled at the power of SQL, but nonetheless, I didn't feel completely off guard or surprised by SQL's behavior (compared to Python's behavior). I thoroughly enjoyed listening to Downing's comments and approach to teaching SQL, so it was a nice refresher.\n\n\n\n~~ Tip of the Week: ~~\n\nThere is a fascinating tool out there called Elastic Search that not only serves as a data storage (Elastic Cloud clusters), but also makes searching data much faster. Many companies have been switching to or testing out elastic search because of the features it offers. Not only does it provide optimized searches, but it gives the programmers the ability to monitor and watch statistics on the data sent, stored, and received. Its incredibly effect if you want to build clustered data storages, and so many nodejs applications prefer to use Elastic Search and Elastic Cloud as their data storage.\n\n", "title": "Week 11 - November 1st Week Blog", "category": "cs373"}, "Week 12 - November 7th Week Blog": {"date": "20161113", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nI spent the majority of last week working on completing any of the unfinished requirements from the previous project phase as well as the current project phase, attending class lectures, and finishing the reading assignments. In particular, my group and I pursued to fix several bugs plaguing our project from the last phase, and I've been spending a great deal of time trying to find a way to implement the search API in our project. It'll be interesting to see how we can get the search working with our current set up with flask restless.\n\n\n~~ What is in your way? ~~\n\nRight now, I think perhaps the motivation is missing, which can be a large barrier to being more productive. The way our project is structured worries me a lot, and honestly, was not at all what was envisioned in the first place. Obviously, the current setup is a shortcut to accomplishing what we needed to last phase, but with a huge cut to flexibility. With constant bugs and barriers in flexibility, its just very unmotivating.\n\n\n\n~~ What will you do next week? ~~\n\nNext week will be primarily focused on finishing the final project phase. We have to not only finalize our project product, but create a presentation and critique another group's product. I don't really see my time going to anything other than class and finishing this project.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nSince there was nothing due this week for SWE, it was definitely a relaxing week. It was interesting reviewing the refactoring approaches that were discussed in the assigned readings. Some of the questions on the quizzes were interesting this week and last week too... Really, the quizzes were interesting because I felt the questions were poorly written, but that's my own opinion. The refactoring discussions we've been having this week have been extremely helpful though.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nI haven't been too shocked or overwhelmed by the material this week. Refactoring is an interesting topic, but it leaves little to anything other than the common sense of programmers. If you have the time to clean up your code, of course, the approaches Downing spoke on seemed to be general rules of thumb. Any way, I've always been more interested in the programming language behaviors and why they behave certain ways.\n\n\n\n~~ Tip of the Week: ~~\n\nIf you are ever interested in designing an android app with augmented reality, its remarkably easier to do get started than you would think. For android, you're not only allowed to access the camera, but you can customize how the camera is displayed or used. Using the camera library (from the hardware package), you can overlay a surface view over the displayed camera in order to add images or render objects over the camera. Also, you can detect direction from the compass library (of Google Maps API, which ever library you'd prefer to use), which can assist with updating the location or appearance of the surface view objects displayed over the camera (meaning removing or shifting the images off the screen). Augmented reality is very much of a practical thing to do.\n\n", "title": "Week 12 - November 7th Week Blog", "category": "cs373"}, "Week 6 - February 28th Week Blog": {"date": "20160228", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week has been crammed with organzing the end of the year concert, spring break, and studying for the Object Oriented programming exam. While the majority of the time spent went to the extracurricular part of my life, a great amount of time was poured into doing the readings and reviewing the class content before the exam this last friday.\n\n2. What is in your way?\n\nNothing was particularly in my way this week, but the exam was definitely a lot harder than I anticipated for. The exam didn't include any multiple choice questions like I had expected. In fact, the exam was only a couple of very precise questions from the readings and the remaining questions but definitely copious in work compared to the time we had to complete the exam. I feel like the exam was definitely a hour and 15 minute exam crammed into a 50 minute exam. Perhaps the one thing in my way in succeeding in this exam was the ability to write and adapt to new problems in a quick manner. Preparing for a few problems that encourage growth in the knowledge of the topic would've certainly helped me prepare better. One other obstacle seemed to be my attitude, as right before the test the alorithm and complexity course exam grades were released, and they were pretty brutally graded for the most part. The sheer disappointment in the class average probably inhibited any expression of hope in the OOP exam.\n\n3. What will you do next week?\n\nNext week will be very tough, but not in terms of the material in OOP. Hopefully, this next week will allow me to get somewhere between 5 to 7 hours each night. I have two tests, a project, a essay, and a assignment due this upcoming week. My weekend will be totally winded down towards preparing for this dreadful week.... I will, however, be excited to go back to OOP lecture and doing the readings, because the class is seriously genuinely interesting.\n\n\nMy experiences with CS371P this week:\n\nIt was probably more full of dread and despair than anything else. The lectures were cool and fun, where lambdas were the core topic aside from the test, but the test left me in unease and utter disappointment in my abilities to recall book content and material (eventhough the book based  questions were only 1/11 of the test grade).\n\n\nMy reactions to CS371P material this week:\n\nMy reaction was mostly excited, relaxed, and inspired, since this week seemed to be easy going. With the test grades returning and the test I just took, the reaction really went down hill. I need to just accept the fact that these tests are the core of my education, and so I'll be working on making sure to rely on enjoying the class despite what ever grade I get.\n\n\nTip of the Week:\n\nSo one big tip for all of those javascript wannabes:\n\nWhenever you are using a function inside of window.setTimeout, window.onload, etc., be sure to not include the parenthesis. Whenever the function is receiving a function to be executed later, passing the function in as a argument or saving it to a variable will cause it to execute immediately if and only if the programmer passes it with the parenthesis. If there are no parenthesis, then the objects/functions that receive the function object will execute properly and on a timely manner.\n\n\n", "title": "Week 6 - February 28th Week Blog", "category": "cs371p"}, "Week 4 - February 14th Week Blog": {"date": "20150214", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week was a nightmare. Not so much that there was a lot to do, which there was, but I was dedicated to a morning and evening christian session that would take up six or so hours of my time each day. The project was due this thursday, being the primary focus of my homework towards this class, and my partner and I spent about a dozen hours this week alone working on perfecting the algorithms of our project solution. Unfortunately, each of our meetings were late at night, making it difficult for me to find time to sleep. So essentially, this week I worked on trying to fit time into understanding and implementing the solution for the project while also doing some of the miscellaneous readdings that Professor Downing put on the schedule.\n\n2. What is in your way?\n\nWhat is in my way is my dedications. I have the passion and intiative to engage and take part in all of the homework and activities that need ot be done to be successfull in this course, but finding the time apart from my dedications places me in dispair. I just can't figure out when to stop my dedications to my other organizations and begin working on finalizing my work with this course. Perhaps I'll have to start really separating the work by days instead of by hours.\n\n3. What will you do next week?\n\nThis next week will definitely cruise along just fine. With only one test, no assignments or projects due, getting the material/readings/homeworks completed shouldn't be a issue. I'll be reviewing for the upcoming test, uh oh, continue to read the material assigned as well as review some of the previous assignments and notes. Hopefully with this combination, the week after will be another breezy week, where no efforts will have to really take part. I enjoy the material Downing teaches and the content the readings contain have so much useful information that I will need to know for the upcoming internships. Lets hope for the best that I can manage to stay on track.\n\n\nMy experiences with CS371P this week:\n\nI was stressed but also relieved at the success of managing to finish the project and understand the lessons taught. Downing is a great lecturer and the TAs do a wonderful job in clarifying the objectives/details of the homeworks and assignments. This week made me realize that there really are many different abstractions in c++ that I don't know, and how templates are such a useful tool in writing functions/methods. Templates will be my hero and savior for sure.\n\nMy reactions to CS371P material this week:\n\nI was shocked to see how templates worked, where I realized that lists and other abstract structures are treated the way they are. I always had a hard time understanding why those datastructures had <type>, but these lectures not only helped me understand why they exists, but the powers of the different iterators available. The all mighty abstractions are starting to over rule my thoughts and feelings.\n\nTip of the Week:\n\nGit merges are a nasty pain. When you can merge the dev with the master, it may look smooth. The problem occurs, however, when the add and commits show a file that has conflicting versions across dev and master branches. If you are absolutely desperate to update master with the dev material, don't be afraid to use the git mergetool. The reason I mention this is because when you only have 5 minutes to turn in a project and obtain the git sha, having time to resolve the issues between the details of the project may cause you to turn it in late. The git mergetool is a life saver in that it can quickly show you which parts of the code are in conflict and gives you options to quickly resolve all the issues without even spending a minute. This tool is magical and deserves every browne point and man or woman could ever offer. This is just another reason to praise the quality of github.\n\n\n", "title": "Week 4 - February 14th Week Blog", "category": "cs371p"}, "Week 3 - September 5th Week Blog": {"date": "20160911", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week composed of more work than I expected or I probably should have done. With several assignments and projects due, I hardly even managed to get half of the SWE readings out of the way. With having to optimize Collatz, write two android apps, vector calc and crypto homework, I felt extremely overwhelmed. Even so, that the stress was causing my throat to swell more (I've had a sore throat since Monday). I guess for the most part, I spent the majority of last week stressing out, but it all worked out in the end.\n\n\n\n~~ What is in your way? ~~\n\nSome of the obstacles in my way are organization commitments, sore throat (turns out it was an ulcer on my uvula, that's probably what I get for eating extremely hot food), and of course, eating and sleeping... Too bad I actually need to eat and sleep, or else I would be so much more productive. Although these may seem like barriers to helping more acadmic performance, reallistically, they're probably helping me stay motivated in my school work (except for the sore throat).\n\n\n\n~~ What will you do next week? ~~\n\nNext week, I'll be attending class, studying for the first midterm, finishing the readings (especially extreme programming installed), and showing up to my organization meetings (missed a couple last week). Hopefully, I'll get a partner and get started on project 2, I really don't like staying up late finishing up a procrastinated project.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nIt was a fun, but a little less enjoyable than usual because of being slightly sick and the late nights. I'll need to work on my time management a little bit... but my experiences were mostly positive. I was slightly frustrated with Sphere and myself for the amount of time wasted in getting SphereCollatz.py to pass. Lesson learned for sure.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nThe lectures this week are still close to identical to the OOP lectures from last semester, but it was interesting to learn some of the underlying exceptions and behaviors of Python. It seems like Tuples, Lists, Dictionaries, and Sets will be fundamentally useful in my future projects in a variety of ways. I've always been mostly fascinated with Python Dictionaries, but never knew the different established rules on dictionaries as well as tuples, lists, and sets. Looks like these internal data structures will have a lot of weird future behavior.\n\n\n\n~~ Tip of the Week: ~~\n\nWhen you're sick, coughing, annoyed, angry, stressed, or just have a common cold, don't push yourself too hard on the projects. They may very well hurt you or even worse, send you to the hospital. Naturally homework induces healthy and unhealthy stress, but not over consuming the unhealthy stress is partially the key to suviving college... Just don't let it get the best of you. You know, there is some irony in this whole \"work/life style\". We overwork so that we can afford to take care of ourselves, but its the very same work that makes taking care of ourselves too expensive.\n\n\n", "title": "Week 3 - September 5th Week Blog", "category": "cs373"}, "Week 1 - August 24th Week Blog": {"date": "20160828", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nTis the season of short shorts and hot weather, a warm and sweaty start to a new semester at UT Austin.\n\nMuch like every other student (or most of them I hope), I spent the majority of this week roaming class to class, receiving my \"destiny\" (syllabi), and sitting through many awe inspiring lectures. In particular, Mr. Downing never disappoints to prematurely provide the class highlights.\n\nThis week we learned some preliminary python basics as well as the purpose of assertions and unit tests. Although I've already witnessed Mr. Downing's explanation of assertions and unit tests (in his CS 371P course), I still enjoyed listening to Mr. Downing's lecture.\n\n\n\n~~ What is in your way? ~~\n\nOther than my relationships with my friends, family, girlfriend, and God, there isn't anything standing between me and Mr. Downing's assignments. Of course, Netflix is seductive in its own sense, but the PCL has been calling my name tad bit louder.\n\nRealistically, upcoming interviews (though I'm not entirely sure how dedicated I am to preparing for them - because of current offers) and organization kick offs have been keeping me fairly busy, so I hope that they will tone down in the future.\n\n\n\n~~ What will you do next week? ~~\n\nMy objectives this next week include finishing Collatz (shouldn't take any longer than an hour) with some optimizations, attend the lectures, and accomplish the scheduled readings. The readings will probably be the tougher part of the batch, but I should have plenty of time to spare.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nIts been fun and exciting. Its nice to see Mr. Downing, though it was pretty saddening to hear we're doing tests through Canvas again (they have terrible formatting for coding questions). I guess my experience was relaxed and underwhelmed for the most part.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nI felt a bit mixed with the overall class. Even though it seems like CS 371P from last year, I want to make sure I do well on the tests this time... The tests on Canvas can be extremely challenging. The material this week was refreshing, however, I'm sure the course content will get more exciting as the semester continues.\n\n\n\n~~ Tip of the Week: ~~\n\nIt turns out that you can run the jekyll github-pages server from your Windows machine. You just have to install Ruby, Chocolatey, jekyll, and bundler. Follow the instructions from this page (\"Installation\" and \"Install github-pages\") :\nhttps://jekyllrb.com/docs/windows/\n\n", "title": "Week 1 - August 24th Week Blog", "category": "cs373"}, "Week 13 - April 24th Week Blog": {"date": "20160424", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThe schedule for this past week made me feel a bit hopeless, but finishing the assignments and the project didn't seem so bad at all. I don't know if the school work is easier than they usually are, but I managed to finish all of my assignments and projects on time this week. The majority of this week was spent going over the remaining details of how to properly construct and destruct children of abstract classes and finishing the Life project. Downing even went over several key points on how to extensively create multiple versions of abstract classes if there needs to be a distinction between abstract child branches. As for project Life, my partner and I managed to meet up almost everyday to get parts of the project done, so by the time the project was due, it was a breeze to finish (even though the deadline was extended by one day).\n\n2. What is in your way?\n\nNothing was really in my way this week. My partner and I found the time and gave the needed effort to successfully accomplish our project. Although the project went smoothly, I am still not so prepared for the test in a few weeks. This week has been perfectly busy and productive, but I wish I was a little less lazy so I could have started studying for the test.\n\n3. What will you do next week?\n\nI hope to spend a good amount of time studying for the test and finishing the remaining readings. This final test is my final redemption to keep my grade as a B, as its currently in the C range (didn't do so hot on the first test with the whole Canvas test environment).\n\nMy experiences with CS371P this week:\n\nThis week's lectures were extremely helpful in guiding my partner and I in project Life's development. While most of the lecture content was already implemented in our project, there were quite a few pieces of advice that we didn't catch until this week. My experience with OOP this week was mostly encouraging but also a great growing experience in the exposure to me on the abstraction of classes and their heirarchies.\n\nMy reactions to CS371P material this week:\n\nI had a ton of fun. This project was another game development/cell automata based platform, which for me is an exciting topic to fool around with. I was surprised to see the effects and usefulness of abstract classes despite how bare bone the abstract classes appear.\n\nTip of the Week:\n\nIf you ever want to learn how to be a full stack engineer, freecodecamp.com will give you a full stack engineer certificate if you complete all of their modules (supposedly it takes around 2048 hours to complete). Learning the tools and skills of a full stack engineer has great benefits in equipping you for backend, middleware, and front end development, and has a great demand out in the job market.\n", "title": "Week 13 - April 24th Week Blog", "category": "cs371p"}, "Test Blog": {"date": "20160326", "content": "\n", "title": "Test Blog", "category": "vac"}, "Week 2 - August 29th Week Blog": {"date": "20160904", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nWith the syllabus day out of the way, every one of my professors have felt obliged to give out a variety of assignments. In particular, this past week has been full of starting new projects and finishing several first homework and reading assignments. While they were not very strenuous in nature, the homeworks and readings did take up a great deal of time.\n\n\n\n~~ What is in your way? ~~\n\nWith last weekend being labor day weekend and my gf's birthday, I didn't have a chance to spend much time getting ahead on homework this weekend. Normally I need the weekends to catch up on homework, since I spend the majority of the weekdays at organization events. I'll need to find a way to spare time during this week to accomplish/finish all of the assignments that are due this upcoming week.\n\n\n\n~~ What will you do next week? ~~\n\nThis next week will be cluttered with finishing the projects. I might not have time to complete the readings, but I may be able to do most of the given readings. With Collatz due on Thursday and several other homeworks due this week, it'll be a little difficult to work around my organization events to accomodate for finishing the programming. Of course, I'll also be spending time this week to attend every lecture, Mr. Downing is too entertaining to miss.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nI've had positive experiences this week with the lectures and readings. Nothing was due in SWE this week, but all of the lectures have contributed a great deal of useful knowledge for testing and writing optimal programs. There were some laughs in there too, but I mostly enjoyed learning about white/black box testing and optimizing Collatz.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nThe material taught this week is still very similar to the material taught in OOP, so there weren't necessarily any surprises. I enjoyed the reminders that Mr. Downing gave on the testing and optimizing of Collatz, but I felt a bit stressed with the fact that we'll have to accomodate a third optimization in Collatz to pass Sphere.\n\n\n\n~~ Tip of the Week: ~~\n\nEven though you can probably finish a project in one night, its always best to work on the assignments ahead of time, so you can digest the issues in your project in ease. Its extremely stressful designing software when you don't have the time or comfort to think through the issues. Without the stress or discomfort, you can easily dissect the issue and finish your assignments on time, that is if you start early. Always start early, my friends.\n\n\n", "title": "Week 2 - August 29th Week Blog", "category": "cs373"}, "Week 14 - May 1st Week Blog": {"date": "20160501", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week was the calm before the storm. Only one assignment was due this past week, and it wasn't even in OOP. The problem is, however, that I have 3 tests, 2 assignments, and a essay due next week. So like I said, its the calm before the storm. I spent the majority of the OOP related time to studying for the final test. I need a heck of a good grade on this test if I plan on making sure I keep my B. Luckily downing doesn't do the +/- system, but it can be very dramatic to my GPA if I were to drop even a fraction of a point below the 800 points I need. I've also been spending sometime ensuring that my portfolio on Seelio is completed, I really need those extra points to ensure the grade I want too.\n\n2. What is in your way?\n\nI have other tests, assignments, and an essay that I've been busy with, so sacrificing some of that time for to studying for the OOP test just hasn't been very practical for me. I hope I can find the motivation to seriously sit down and understand all the material I need to know. I'll probably join a couple of study groups to optimize the productivity of my studying.\n\n3. What will you do next week?\n\nNext week I'll be semi-zombie and semi-asleep. I don't think I'll be altogether anywhere. I just hope I make it out of hell week with all of my toes and fingers. I do plan on studying a good amount for this final OOP test. Its awesome we don't have a final, but it is a little dramatic that this is my final opportunity.\n\nMy experiences with CS371P this week:\n\nThis week was a little boring, but still useful. My experience with the in class lectures was that I felt more confident on what a handle was (our last project had one and I was so confused as to what its purpose was), but the remainder of the material seemed to be a little less important as prepping for the final test deemed to be even more important at the time. Although it was a little boring, finish the seelio was fun. Seelio may not be Object Oriented programming related, but it was related to the bonus for this class. It may very well be my life saver.\n\nMy reactions to CS371P material this week:\n\nI was a bit fond of the topic on handlers in OOP, but my reactions were a bit dull in regards to the material this week. I'm ready for a break, its been a very busy semester. My core reaction was happy and confident on the handlers topic, but distracted on the fact that the test is coming up.\n\nTip of the Week:\n\nIf you are looking for a forum of online free classes, here is a great post on Reddit that lists around 156 of them: https://www.reddit.com/r/learnprogramming/comments/3fvz78/heres_a_list_of_156_free_online_programmingcs/\n\nI personally Love the introduction to databases from Stanford, it gave me a great overview on the how to and importance of implement databases in the right way (with parsers).\n", "title": "Week 14 - May 1st Week Blog", "category": "cs371p"}, "Week 5 - September 19th Week Blog": {"date": "20160925", "content": "\nOn the topic of CS373.\n\nCore Questions:\n\n~~ What did you do this past week? ~~\n\nThis past week was full of finishing the Netflix project, reading assignments, and attending Downing's lectures. It was really fascinating to have the employee from JPL present the project that they've been working on. I never knew the bounds and sophistication of some of the software that has been developed until then. The majority of my time went to the Netflix project though, so hopefully I'll transition that time over to working on studying for the upcoming test.\n\n\n\n~~ What is in your way? ~~\n\nThis week was just really busy with other course projects and tests. If the other courses didn't have the projects or tests all at the same time, I probably would have more time to spend on reviewing and learning about software engineering. The organization meetings and personal issues have really died down lately, so that's been helpful in maintaining my work load this week.\n\n\n\n~~ What will you do next week? ~~\n\nThis next week will comprise mostly of studying and prepping for the upcoming test. I know there are lectures and readings to do, but reviewing the material and projects we've accomplished (as well as quizzes) will probably assist in ensuring I can do well on the test next week. I suppose this means that I'll be meeting with classmates to form study groups and study sessions.\n\n\n\n~~ My experiences with CS373 this week: ~~\n\nThis week was fun, especially with implementing Netflix. Netflix was a fascinating (and not as hard) project that really showed how simple some issues can be to fix. The articles and readings were useful (also dramatic), in reminding me of precision in programming, javascript, and sql management. I'm very excited to start applying these readings to the future group projects, which is the real reason I'm a part of this class.\n\n\n\n~~ My reactions to CS373 material this week: ~~\n\nI was surprised by the presenter from JPL, to learn more about the Python semantics, and see some of the underlying behaviors of Python. Downing always has a great way of presenting and explaining some of the issues and exceptions that are in Python. The Netflix material was certainly stressful at first, but made me feel accomplished and at ease near the end. I suppose this week was more of a confident and excited reaction to the material given.\n\n\n\n~~ Tip of the Week: ~~\n\nWhen designing android apps, be very careful about the objects created and destroyed. Sometimes maintaining or updating objects will take twice as long as they should, but there are many optimizations out there that keep you from recreating an object (or view in this case). One particular case that is often missed is when you create listviews, always be sure to check the view exists before creating a new view in the getView method. This alone can surely make your app work twice as fast.\n\n\n", "title": "Week 5 - September 19th Week Blog", "category": "cs373"}, "Week 8 - March 13th Week Blog": {"date": "20160313", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week was full of rest and none OOP related activities. As the students don't have class during Spring Break, there was still a Object Oriented Programming project that is the week following Spring Break. It seems that there might be a mob that'll rise up to fight the tyranny of professors utilizing the Spring Break period for projects, but I don't really mind. I spent a hour or two this week working on the Allocator Project, getting all the initial files and set up done. Other than that, there didn't seem to be any OOP related activities on my end.\n\n2. What is in your way?\n\nThis time Spring Break was in my way. I was enjoying myself so much that I forgot where I was or what was due the following week. The enjoyment wasn't so much the fun as the rest and comfort of being away from the school work. Its nice to have a break and it certainly got in my way of accomplishing any OOP objectives. Although it seems like its in the way of my productivitiy in this class this week, the rest is definitely going to be a great investment for future assignments, as the tiredness won't weigh me down so much.\n\n3. What will you do next week?\n\nThis next week, I'll be finishing the Allocator OOP project and working on the readings. Even though I have started the project, there is still so much to do this week. I'll have to meet up with my partner to ensure that the project is successfully completed. Also, getting back in the rhythm will be a key player to my performance in OOP.\n\n\nMy experiences with CS371P this week:\n\nThere wasn't a single experience to reflect on, just a feeling of comfort and relaxation. With no class lectures.\n\n\nMy reactions to CS371P material this week:\n\nThere was no material to react to, only the satisfaction of rest.\n\n\nTip of the Week:\n\nWhen it comes to programming, always ensure to get some rest and relaxation. If you stress yourself too much on solving a problem, you can easily burn yourself out and even waste hours of your time. Getting periods of rest in between each session of work is essential to your performance and your health. You'll think faster on your feet, and you'll feel more confident with the solutions you implement. As always, don't let the sleep get the best of you, be sure to wake up and finish your work, or else the rest won't be worth its time.\n\n\n", "title": "Week 8 - March 13th Week Blog", "category": "cs371p"}, "Week 12 - April 17th Week Blog": {"date": "20160417", "content": "\nOn the topic of CS371P.\n\nCore Questions:\n\n1. What did you do this past week?\n\nThis past week was very relaxing, where there wasn't a single assignment due, a test to take, or a project to finish. I spent the majority of this week reviewing and working on the project that is due next week, Life, as well as go to lecture to learn about parent to child inheritance, and the applications of abstract base classes have on their children. Essentially, the object oriented programming part of my week was not so busy, only some lecture attendance, book readings, and planning/starting the Life project. Guessing from the last project and reviews from previous years about Life, I'll be living in the GDC basement for the next week.\n\n2. What is in your way?\n\nAs a co-founder of the organization Need2Austin, we partnered with 3 other organizations to do a big concert called a Jam Scramble, I'm a part of the board to obtaining the equipment and arranging the materials for the concert to successfully take place. The preparation of the concert was not the only obstacle that absorbed my time, but also the event itself took all of my Thursday away from me, a core day that I spend working on OOP material. Also being a part of the christian organizations has taken a piece of my time out too. With these organizational obligations, OOP became a far fetched dream that I couldn't quite find enough time.\n\n3. What will you do next week?\n\nNext week, doesn't look too pretty. With the two big assignments and the Life project, I'll be lucky if I have any time to read the OOP material. While it looks like we'll be expanding on abstraction and inheritance, hopefully the lectures will give more insight on the tools we need to know to successfully finish the Life project.\n\nMy experiences with CS371P this week:\n\nI had fun learning about the next project and about abstraction. It was really odd to hear about the applications and uses of abstract classes, but it eventually made more sense when we began planning out Life. My overall experience was good and productive, but it was a little more laid back than my usual experiences. The topics downing went over weren't difficult at all and the project has been too difficult yet, which is a good sign.\n\nMy reactions to CS371P material this week:\n\nI was pleased that more of the lectures this week were geared to help us on the Life project. Although the material isn't as exciting as last week, I was enjoying the lectures and the topics thoroughly.\n\nTip of the Week:\n\nWhenever you program, please be sure to spread out the project work across the time frame you have to work on it. If you do it the night before, you'll lose the opportunities to sleep over what kind of work you've done and/or think over the problems you ran into. Committing only an hour or two a day is totally enough to get a project done on time with quality work. You'll be surprised how much less code you'll end up using and how much more precise and correct your algorithms will be.\n", "title": "Week 12 - April 17th Week Blog", "category": "cs371p"}}